Revit 2026 API

# ViewFamilyTypeViewFamily Property

---

The ViewFamily for this view type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ViewFamily ViewFamily { get; }
```
```vb
Public ReadOnly Property ViewFamily As ViewFamily
	Get
```
```cpp
public:
property ViewFamily ViewFamily {
	ViewFamily get ();
}
```
```fsharp
member ViewFamily : ViewFamily with get
```

#### Property Value

ViewFamily

#### Reference

ViewFamilyType Class

Autodesk.Revit.DB Namespace